<?php

namespace Database\Seeders;

use App\Models\Broadcaster;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class BroadcasterSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $broadcasters =
            [
                ['name' => 'Иван Вельчинский', 'image_path' => 'broadcasters/presenter1.png',
                    'bio' => [
                    'ru' => 'Привет, я Вэл, из династии не смотревших «Игру престолов», но надеющихся когда-нибудь её посмотреть! Родился на севере, и не понаслышке знаю, что такое -53 за окном. Единственное, с чем я никогда не смирюсь в этой жизни, это когда дерёшься во сне с замедлением. Панически боюсь высоты, но прыгал с парашютом БЕЗ ИНСТРУКТОРА (люблю своих друзей и их подарки). Я тебя еще не знаю, но иди сюда, обниму!',
                    'kk' => 'Сәлем, мен Валмын, «Тақтар ойынын» көрмеген, бірақ оны бір күні көремін деп үміттенетін адамдар қатарынан! Мен солтүстікте дүниеге келдім, терезе сыртындағы -53 дегенді өз көзіммен білемін. Мен бұл өмірде ешқашан келіспейтін жалғыз нәрсе - сіз ұйықтап жатқанда баяу қозғалыста ұрысқаныңыз. Мен биіктіктен қорқамын, бірақ мен НҰСҚАУШЫСЫЗ парашютпен секірдім (мен достарымды және олардың сыйлықтарын жақсы көремін). Мен сені әлі танымаймын, бірақ мұнда кел, мен сені құшақтаймын!'
                ],
                    'instagram_url' => 'https://www.instagram.com/radio_ns/', 'youtube_url' => 'https://www.instagram.com/radio_ns/', 'whatsapp_url' => 'https://www.instagram.com/radio_ns/', 'telegram_url' => 'https://www.instagram.com/radio_ns/'],
                ['name' => 'Алена Малышева',  'image_path' => 'broadcasters/presenter2.png', 'bio' => [
                    'ru' => 'Привет, я Вэл, из династии не смотревших «Игру престолов», но надеющихся когда-нибудь её посмотреть! Родился на севере, и не понаслышке знаю, что такое -53 за окном. Единственное, с чем я никогда не смирюсь в этой жизни, это когда дерёшься во сне с замедлением. Панически боюсь высоты, но прыгал с парашютом БЕЗ ИНСТРУКТОРА (люблю своих друзей и их подарки). Я тебя еще не знаю, но иди сюда, обниму!',
                    'kk' => 'Сәлем, мен Валмын, «Тақтар ойынын» көрмеген, бірақ оны бір күні көремін деп үміттенетін адамдар қатарынан! Мен солтүстікте дүниеге келдім, терезе сыртындағы -53 дегенді өз көзіммен білемін. Мен бұл өмірде ешқашан келіспейтін жалғыз нәрсе - сіз ұйықтап жатқанда баяу қозғалыста ұрысқаныңыз. Мен биіктіктен қорқамын, бірақ мен НҰСҚАУШЫСЫЗ парашютпен секірдім (мен достарымды және олардың сыйлықтарын жақсы көремін). Мен сені әлі танымаймын, бірақ мұнда кел, мен сені құшақтаймын!'
                ],
                    'instagram_url' => 'https://www.instagram.com/radio_ns/', 'youtube_url' => '', 'whatsapp_url' => 'https://www.instagram.com/radio_ns/', 'telegram_url' => 'https://www.instagram.com/radio_ns/'],
                ['name' => 'Павел Смелов',  'image_path' => 'broadcasters/presenter3.png', 'bio' => [
                    'ru' => 'Привет, я Вэл, из династии не смотревших «Игру престолов», но надеющихся когда-нибудь её посмотреть! Родился на севере, и не понаслышке знаю, что такое -53 за окном. Единственное, с чем я никогда не смирюсь в этой жизни, это когда дерёшься во сне с замедлением. Панически боюсь высоты, но прыгал с парашютом БЕЗ ИНСТРУКТОРА (люблю своих друзей и их подарки). Я тебя еще не знаю, но иди сюда, обниму!',
                    'kk' => 'Сәлем, мен Валмын, «Тақтар ойынын» көрмеген, бірақ оны бір күні көремін деп үміттенетін адамдар қатарынан! Мен солтүстікте дүниеге келдім, терезе сыртындағы -53 дегенді өз көзіммен білемін. Мен бұл өмірде ешқашан келіспейтін жалғыз нәрсе - сіз ұйықтап жатқанда баяу қозғалыста ұрысқаныңыз. Мен биіктіктен қорқамын, бірақ мен НҰСҚАУШЫСЫЗ парашютпен секірдім (мен достарымды және олардың сыйлықтарын жақсы көремін). Мен сені әлі танымаймын, бірақ мұнда кел, мен сені құшақтаймын!'
                ], 'instagram_url' => '', 'youtube_url' => 'https://www.instagram.com/radio_ns/', 'whatsapp_url' => 'https://www.instagram.com/radio_ns/', 'telegram_url' => 'https://www.instagram.com/radio_ns/'],
                ['name' => 'Иван Вельчинский', 'image_path' => 'broadcasters/presenter1.png',
                    'bio' => [
                        'ru' => 'Привет, я Вэл, из династии не смотревших «Игру престолов», но надеющихся когда-нибудь её посмотреть! Родился на севере, и не понаслышке знаю, что такое -53 за окном. Единственное, с чем я никогда не смирюсь в этой жизни, это когда дерёшься во сне с замедлением. Панически боюсь высоты, но прыгал с парашютом БЕЗ ИНСТРУКТОРА (люблю своих друзей и их подарки). Я тебя еще не знаю, но иди сюда, обниму!',
                        'kk' => 'Сәлем, мен Валмын, «Тақтар ойынын» көрмеген, бірақ оны бір күні көремін деп үміттенетін адамдар қатарынан! Мен солтүстікте дүниеге келдім, терезе сыртындағы -53 дегенді өз көзіммен білемін. Мен бұл өмірде ешқашан келіспейтін жалғыз нәрсе - сіз ұйықтап жатқанда баяу қозғалыста ұрысқаныңыз. Мен биіктіктен қорқамын, бірақ мен НҰСҚАУШЫСЫЗ парашютпен секірдім (мен достарымды және олардың сыйлықтарын жақсы көремін). Мен сені әлі танымаймын, бірақ мұнда кел, мен сені құшақтаймын!'
                    ],
                    'instagram_url' => 'https://www.instagram.com/radio_ns/', 'youtube_url' => 'https://www.instagram.com/radio_ns/', 'whatsapp_url' => 'https://www.instagram.com/radio_ns/', 'telegram_url' => 'https://www.instagram.com/radio_ns/'],
                ['name' => 'Алена Малышева',  'image_path' => 'broadcasters/presenter2.png', 'bio' => [
                    'ru' => 'Привет, я Вэл, из династии не смотревших «Игру престолов», но надеющихся когда-нибудь её посмотреть! Родился на севере, и не понаслышке знаю, что такое -53 за окном. Единственное, с чем я никогда не смирюсь в этой жизни, это когда дерёшься во сне с замедлением. Панически боюсь высоты, но прыгал с парашютом БЕЗ ИНСТРУКТОРА (люблю своих друзей и их подарки). Я тебя еще не знаю, но иди сюда, обниму!',
                    'kk' => 'Сәлем, мен Валмын, «Тақтар ойынын» көрмеген, бірақ оны бір күні көремін деп үміттенетін адамдар қатарынан! Мен солтүстікте дүниеге келдім, терезе сыртындағы -53 дегенді өз көзіммен білемін. Мен бұл өмірде ешқашан келіспейтін жалғыз нәрсе - сіз ұйықтап жатқанда баяу қозғалыста ұрысқаныңыз. Мен биіктіктен қорқамын, бірақ мен НҰСҚАУШЫСЫЗ парашютпен секірдім (мен достарымды және олардың сыйлықтарын жақсы көремін). Мен сені әлі танымаймын, бірақ мұнда кел, мен сені құшақтаймын!'
                ],
                    'instagram_url' => 'https://www.instagram.com/radio_ns/', 'youtube_url' => '', 'whatsapp_url' => 'https://www.instagram.com/radio_ns/', 'telegram_url' => 'https://www.instagram.com/radio_ns/'],
                ['name' => 'Павел Смелов',  'image_path' => 'broadcasters/presenter3.png', 'bio' => [
                    'ru' => 'Привет, я Вэл, из династии не смотревших «Игру престолов», но надеющихся когда-нибудь её посмотреть! Родился на севере, и не понаслышке знаю, что такое -53 за окном. Единственное, с чем я никогда не смирюсь в этой жизни, это когда дерёшься во сне с замедлением. Панически боюсь высоты, но прыгал с парашютом БЕЗ ИНСТРУКТОРА (люблю своих друзей и их подарки). Я тебя еще не знаю, но иди сюда, обниму!',
                    'kk' => 'Сәлем, мен Валмын, «Тақтар ойынын» көрмеген, бірақ оны бір күні көремін деп үміттенетін адамдар қатарынан! Мен солтүстікте дүниеге келдім, терезе сыртындағы -53 дегенді өз көзіммен білемін. Мен бұл өмірде ешқашан келіспейтін жалғыз нәрсе - сіз ұйықтап жатқанда баяу қозғалыста ұрысқаныңыз. Мен биіктіктен қорқамын, бірақ мен НҰСҚАУШЫСЫЗ парашютпен секірдім (мен достарымды және олардың сыйлықтарын жақсы көремін). Мен сені әлі танымаймын, бірақ мұнда кел, мен сені құшақтаймын!'
                ], 'instagram_url' => '', 'youtube_url' => 'https://www.instagram.com/radio_ns/', 'whatsapp_url' => 'https://www.instagram.com/radio_ns/', 'telegram_url' => 'https://www.instagram.com/radio_ns/'],
                ['name' => 'Иван Вельчинский', 'image_path' => 'broadcasters/presenter1.png',
                    'bio' => [
                        'ru' => 'Привет, я Вэл, из династии не смотревших «Игру престолов», но надеющихся когда-нибудь её посмотреть! Родился на севере, и не понаслышке знаю, что такое -53 за окном. Единственное, с чем я никогда не смирюсь в этой жизни, это когда дерёшься во сне с замедлением. Панически боюсь высоты, но прыгал с парашютом БЕЗ ИНСТРУКТОРА (люблю своих друзей и их подарки). Я тебя еще не знаю, но иди сюда, обниму!',
                        'kk' => 'Сәлем, мен Валмын, «Тақтар ойынын» көрмеген, бірақ оны бір күні көремін деп үміттенетін адамдар қатарынан! Мен солтүстікте дүниеге келдім, терезе сыртындағы -53 дегенді өз көзіммен білемін. Мен бұл өмірде ешқашан келіспейтін жалғыз нәрсе - сіз ұйықтап жатқанда баяу қозғалыста ұрысқаныңыз. Мен биіктіктен қорқамын, бірақ мен НҰСҚАУШЫСЫЗ парашютпен секірдім (мен достарымды және олардың сыйлықтарын жақсы көремін). Мен сені әлі танымаймын, бірақ мұнда кел, мен сені құшақтаймын!'
                    ],
                    'instagram_url' => 'https://www.instagram.com/radio_ns/', 'youtube_url' => 'https://www.instagram.com/radio_ns/', 'whatsapp_url' => 'https://www.instagram.com/radio_ns/', 'telegram_url' => 'https://www.instagram.com/radio_ns/'],
                ['name' => 'Алена Малышева',  'image_path' => 'broadcasters/presenter2.png', 'bio' => [
                    'ru' => 'Привет, я Вэл, из династии не смотревших «Игру престолов», но надеющихся когда-нибудь её посмотреть! Родился на севере, и не понаслышке знаю, что такое -53 за окном. Единственное, с чем я никогда не смирюсь в этой жизни, это когда дерёшься во сне с замедлением. Панически боюсь высоты, но прыгал с парашютом БЕЗ ИНСТРУКТОРА (люблю своих друзей и их подарки). Я тебя еще не знаю, но иди сюда, обниму!',
                    'kk' => 'Сәлем, мен Валмын, «Тақтар ойынын» көрмеген, бірақ оны бір күні көремін деп үміттенетін адамдар қатарынан! Мен солтүстікте дүниеге келдім, терезе сыртындағы -53 дегенді өз көзіммен білемін. Мен бұл өмірде ешқашан келіспейтін жалғыз нәрсе - сіз ұйықтап жатқанда баяу қозғалыста ұрысқаныңыз. Мен биіктіктен қорқамын, бірақ мен НҰСҚАУШЫСЫЗ парашютпен секірдім (мен достарымды және олардың сыйлықтарын жақсы көремін). Мен сені әлі танымаймын, бірақ мұнда кел, мен сені құшақтаймын!'
                ],
                    'instagram_url' => 'https://www.instagram.com/radio_ns/', 'youtube_url' => '', 'whatsapp_url' => 'https://www.instagram.com/radio_ns/', 'telegram_url' => 'https://www.instagram.com/radio_ns/'],
                ['name' => 'Павел Смелов',  'image_path' => 'broadcasters/presenter3.png', 'bio' => [
                    'ru' => 'Привет, я Вэл, из династии не смотревших «Игру престолов», но надеющихся когда-нибудь её посмотреть! Родился на севере, и не понаслышке знаю, что такое -53 за окном. Единственное, с чем я никогда не смирюсь в этой жизни, это когда дерёшься во сне с замедлением. Панически боюсь высоты, но прыгал с парашютом БЕЗ ИНСТРУКТОРА (люблю своих друзей и их подарки). Я тебя еще не знаю, но иди сюда, обниму!',
                    'kk' => 'Сәлем, мен Валмын, «Тақтар ойынын» көрмеген, бірақ оны бір күні көремін деп үміттенетін адамдар қатарынан! Мен солтүстікте дүниеге келдім, терезе сыртындағы -53 дегенді өз көзіммен білемін. Мен бұл өмірде ешқашан келіспейтін жалғыз нәрсе - сіз ұйықтап жатқанда баяу қозғалыста ұрысқаныңыз. Мен биіктіктен қорқамын, бірақ мен НҰСҚАУШЫСЫЗ парашютпен секірдім (мен достарымды және олардың сыйлықтарын жақсы көремін). Мен сені әлі танымаймын, бірақ мұнда кел, мен сені құшақтаймын!'
                ], 'instagram_url' => '', 'youtube_url' => 'https://www.instagram.com/radio_ns/', 'whatsapp_url' => 'https://www.instagram.com/radio_ns/', 'telegram_url' => 'https://www.instagram.com/radio_ns/'],
            ];

        foreach ($broadcasters as $broadcaster) {
            Broadcaster::create($broadcaster);
        }
    }
}
