<?php
return [
    'reset_password_label' => 'Сброс пароля',
    'hello_label' => 'Здравствуйте!',
    'description_label' => 'Вы получили это письмо, потому что мы получили запрос на сброс пароля для вашей учетной записи.',
    'expire_label' => 'Ссылка для сброса пароля истечет через 60 минут.',
    'expire_body_label' => 'Если вы не запрашивали сброс пароля, никаких действий не требуется.',
    'trouble_label' => 'Если у вас возникли проблемы с нажатием кнопки "Сброс пароля", скопируйте и вставьте URL ниже в ваш веб-браузер:',
    'all_rights_reserved_label' => 'Все права защищены.',
];
