<?php
return [
    'reset_password_label' => 'Құпиясөзді қалпына келтіру',
    'hello_label' => 'Сәлеметсіз бе!',
    'description_label' => 'Сіз бұл хатты алдыңыз, себебі сіздің аккаунтыңыз үшін құпиясөзді қалпына келтіру сұрауы жіберілді.',
    'expire_label' => 'Құпиясөзді қалпына келтіру сілтемесі 60 минуттан кейін жарамсыз болады.',
    'expire_body_label' => 'Егер сіз құпиясөзді қалпына келтіруді сұрамаған болсаңыз, ешқандай әрекет қажет емес.',
    'trouble_label' => 'Егер "Құпиясөзді қалпына келтіру" түймесін басуда қиындықтар туындаса, төмендегі URL-ді веб-браузерге көшіріп қойыңыз:',
    'all_rights_reserved_label' => 'Барлық құқықтар қорғалған.',
];
